[
  {
    "id": "mini010920251850",
    "title": "The First of Many",
    "date": "2025-09-01",
    "time": "18:50",
    "tags": [
      "blog",
      "first",
      "project"
    ],
    "content": "<p><h1>The First of Many</h1></p><p><hr></p><p>The wait is finally over!  </p><p>After 2 weeks, and roughly 12 hours of development — it’s here. I present to you <strong>Minis by <em>Beyond Me Btw</em></strong>.  </p><p>A live blogging platform where I can share quick updates and thoughts that don’t need a fully produced blog post. It could be a small discovery in tech, a movie review I didn’t enjoy, or just something I feel like talking about.  </p><p>With Minis, I can give live commentary on projects without waiting until the very end.  </p><p>And this is just the start. I’ve got more features planned, maybe even a Twitter bot for fun, and plenty more to come.  </p><p><strong>Stay Tuned, The best is yet to come!</strong></p><p><img src=\"https://content.beyondmebtw.com/experience/exp30.webp\" alt=\"Minis by Beyond Me Btw\" style=\"max-width: 100%; height: auto;\"></p>",
    "rawMarkdown": "# The First of Many\n\n---\n\nThe wait is finally over!  \n\nAfter 2 weeks, and roughly 12 hours of development — it’s here. I present to you **Minis by *Beyond Me Btw* **.  \n\nA live blogging platform where I can share quick updates and thoughts that don’t need a fully produced blog post. It could be a small discovery in tech, a movie review I didn’t enjoy, or just something I feel like talking about.  \n\nWith Minis, I can give live commentary on projects without waiting until the very end.  \n\nAnd this is just the start. I’ve got more features planned, maybe even a Twitter bot for fun, and plenty more to come.  \n\n**Stay Tuned, The best is yet to come!**\n\n![Minis by Beyond Me Btw](https://content.beyondmebtw.com/experience/exp30.webp)"
  },
  {
    "id": "mini010920251857",
    "title": "Triple Threat",
    "date": "2025-09-01",
    "time": "18:57",
    "tags": [
      "movie",
      "movie review"
    ],
    "content": "<p>I ended up watching <em>Venom 3: The Last Dance</em>, <em>Kraven the Hunter</em>, and <em>Madame Web</em> back to back. Venom was fine, but the other two, oh my god. I’d heard the talk about how bad they were when they first released, but seeing them myself was something else entirely. Some of them don’t even warrant full reviews, so here are three short ones instead.</p><p><hr></p><p><strong>Venom: The Last Dance (2024)</strong><br>It’s dumb, but it’s sweet and somehow that’s exactly why it works. Probably the only Sony Spider-Man villain to actually make it through a full trilogy, Venom goes out on a surprisingly fun and heartfelt note. The plot is decent, a little messy in places, but never boring. The dancing scene with Mrs. Chen? Adorable. And Eddie saying goodbye to Venom with <em>Memories</em> by Maroon 5 playing in the background unintentionally hilarious, but still kind of touching. The Venom trilogy might and will be Sony’s best work: fun, ridiculous, but never dull. <strong>10/10</strong></p><p><hr></p><p><strong>Kraven the Hunter (2024)</strong><br>Not even “fun bad,” just bad. Kraven feels like a Russian Tarzan knockoff, and not a good one. The twists are dumb, the characters are weak, and the whole thing drags on until you stop caring. Even cool-sounding characters like Chameleon, Foreigner, and Rhino are wasted and reduced to jokes. Completely forgettable. <strong>1/10</strong></p><p><hr></p><p><strong>Madame Web (2024)</strong><br>I made the mistake of watching this right after <em>Kraven the Hunter</em> and honestly, it made <em>Kraven</em> look like a masterpiece in comparison. This isn’t just boring, it’s boring <em>and</em> dumb. The plot is a mess, the dialogue is weak and action was so bad that a kid smashing action figures together would’ve looked better. You can’t help but wonder if this thing was made as a tax write-off. Worst of all, the cast deserved better they were probably told this was going to be the next big Marvel event, only for it to be the next big joke. <strong>1/10</strong></p><p><hr></p><p>Well, that was that. Six hours in total, and only two of them were actually fun. Skip <em>Kraven</em> and <em>Madame Web</em>, just watch <em>Venom 3</em></p>",
    "rawMarkdown": "I ended up watching *Venom 3: The Last Dance*, *Kraven the Hunter*, and *Madame Web* back to back. Venom was fine, but the other two, oh my god. I’d heard the talk about how bad they were when they first released, but seeing them myself was something else entirely. Some of them don’t even warrant full reviews, so here are three short ones instead.\n\n---\n\n**Venom: The Last Dance (2024)**  \nIt’s dumb, but it’s sweet and somehow that’s exactly why it works. Probably the only Sony Spider-Man villain to actually make it through a full trilogy, Venom goes out on a surprisingly fun and heartfelt note. The plot is decent, a little messy in places, but never boring. The dancing scene with Mrs. Chen? Adorable. And Eddie saying goodbye to Venom with *Memories* by Maroon 5 playing in the background unintentionally hilarious, but still kind of touching. The Venom trilogy might and will be Sony’s best work: fun, ridiculous, but never dull. **10/10**\n\n---\n\n**Kraven the Hunter (2024)**  \nNot even “fun bad,” just bad. Kraven feels like a Russian Tarzan knockoff, and not a good one. The twists are dumb, the characters are weak, and the whole thing drags on until you stop caring. Even cool-sounding characters like Chameleon, Foreigner, and Rhino are wasted and reduced to jokes. Completely forgettable. **1/10**\n\n---\n\n**Madame Web (2024)**  \nI made the mistake of watching this right after *Kraven the Hunter* and honestly, it made *Kraven* look like a masterpiece in comparison. This isn’t just boring, it’s boring *and* dumb. The plot is a mess, the dialogue is weak and action was so bad that a kid smashing action figures together would’ve looked better. You can’t help but wonder if this thing was made as a tax write-off. Worst of all, the cast deserved better they were probably told this was going to be the next big Marvel event, only for it to be the next big joke. **1/10**\n\n---\n\nWell, that was that. Six hours in total, and only two of them were actually fun. Skip *Kraven* and *Madame Web*, just watch *Venom 3*"
  }
]